[
    {
        "id": 1,
        "title": "Tudor Black Bay 36",
        "description": "My latest personal build, with the highlight being a hand-engraved dial. The watch started as a vintage Tudor Submariner-esque dive watch, but I changed the case to a 904L steel case as it felt better quality and was more wearble overall. This was also my first time engraving a dial, and I'm very happy with how the logo turned out! Next steps are trying to find a smaller clasp, as the current one is a bit too long."
    },
    {
        "id": 2,
        "title": "1969 King Seiko 45-7001",
        "description": "A grail watch for me. I love the look of hand wound movements through a clear caseback, and at the end of my first internship at Oxford Instruments, I went on a trip to Japan with my family. I fell in love with the history and high beat movement of the 45KS/GS, and when I touched down in Tokyo on vacation with my family, I knew I wanted to find one. I was lucky enough find this example from 1969 (my parents' birth year) in great condition and with a recent overhaul service. I intend on keeping this watch for a very long time, as there are not many left in this condition."
    },
    {
        "id": 3,
        "title": "Seiko Mod: Surfing Snoopy 5",
        "description": "My most recent build for a friend. He loves Snoopy and the Peanuts comics, and since there are an abundance of Seiko parts on the internet, I was able to source the parts relatively easily. Like most Seiko mods, this is powered by a robust NH 36 movement, and the case is designed after the SKX013, a 38mm version of the beloved SKX007 that spearheads the watch modding hobby."
    },
    {
        "id": 4,
        "title": "Vario Versa",
        "description": "I bought this watch after selling my first mechanical watch, as it has a feature that's prevalent on my all-time favorite watch: the watch can flip over to reveal a second face showing a second time zone. Vario made a watch that blends the watch style of the Cartier Tank Basculante with the art deco dial design of the JLC Reverso--two watches that I love but can't yet afford. Unfortunately, this piece may be on the chopping block soon, as I may have found a replacement for it in my collection."
    },
    {
        "id": 5,
        "title": "Omega x Swatch MoonSwatch Mission to the Moonphase - New Moon",
        "description": "When the MoonSwatch series first came out, I found the concept extremely cool but I didn't live near a Swatch store to get one. However, when the Snoopy editions came out, I was in San Diego and living within 19 minuts of a Swatch store. I'd call the store every day when they opened for about a month asking if they received one in stock, and one day I was lucky enough to get one. This watch is one of the most comfortable watches I own, as the plastic case is light and the silicone strap is extremely soft and water resistant. This is a great fun piece and has an iconic presence on the wrist."
    },
    {
        "id": 6,
        "title": "Skagen Dual-Time Rectangle Watch",
        "description": "A surprisingly nice $5 thrift store find. I found this in a Goodwill in La Jolla, and brought it home to clean up. I'm glad to have found a watch that has this dual time design and a minimalist design for such a low price."
    },
    {
        "id": 7,
        "title": "Camy Montego Superautomatic",
        "description": "While visiting my sister in New York in 2024, I knew I wanted to explore the vintage watch scene in the City. I had seen videos of this store in Chinatown called Chen's watches, and decided to look there first. My original goal was to find a vintage Omega Geneve Dynamic with a UFO case, but I was skeptical of the integrated strap and bracelets if I ever needed to replace them. That's when I stumbled upon this Camy, which has a generic ETA movement inside (allowing it to be serviced by almost anyone), and a similar cushion case that looks absurd and feels extremely comfortable on wrist. I tried a few straps with the watch, but found that this tapered ladder-link bracelet suits the watch extremely well and haven't taken it off since."
    },
    {
        "id": 8,
        "title": "Tissot PRX 35mm",
        "description": "Quite a common watch these days, but I chose the 35mm because I believe it is more faithful to the original integrated bracelet watches of the 1970s (Omega Seamaster, Vacheron Constantin 222, etc.). My main goal was to modify the PRX, and found that the 27.5mm dial is extremely common in Swiss watches. I have tried many dials (most notably a Tiffany and Co. dial), but recently swapped it out with this gorgeous red laquer dial. I had always felt that the hands on the PRX were too chunky from factory, and found hands that matched the elegance I was pursuing."
    }
]