[
    {
        "id": 1,
        "title": "Tudor Black Bay 36",
        "description": "My latest personal build, with the highlight being a hand-engraved dial. The watch started as a vintage Tudor Submariner-esque dive watch, but I changed the case to a 904L steel case because it felt higher quality and the size was more wearable. This was also my first time engraving a dial, and I'm very happy with how the logo turned out! Next steps are trying to find a smaller clasp, as the current one is a bit too long."
    },
    {
        "id": 2,
        "title": "1969 King Seiko 45-7001",
        "description": "A grail watch for me. I love the look of hand wound movements through a clear caseback, and when seeing pictures of the movement on the internet, I instantly fell in love. I spent months researching the history and the common issues of the 45KS/GS, and when I touched down in Tokyo on vacation with my family, I immediately looked for one. I was lucky enough to find this example from 1969 (my parents' birth year) in great condition and with a recent overhaul service. The high beat movement is extremely smooth, and I often get mesmerized by the seconds hand gliding across the dial. I intend on keeping this watch for a very long time, as there are not many left in this condition."
    },
    {
        "id": 3,
        "title": "Seiko Mod: Surfing Snoopy 5",
        "description": "My most recent customer build for a friend. He loves Snoopy and since there are an abundance of Seiko parts on the internet, I was able to source the parts relatively easily. Like most Seiko mods, this is powered by a robust NH 36 movement, and the case takes inspiration from the SKX013, a 38mm version of the beloved SKX007 that spearheads the watch modding hobby."
    },
    {
        "id": 4,
        "title": "Vario Versa",
        "description": "I bought this watch after selling my first mechanical watch, as it shares a feature with my all-time favorite watch: the watch’s body can flip to reveal a second face showing a second time zone. Vario made a watch that blends the case style of the Cartier Tank Basculante with the art deco dial design of the JLC Reverso. Unfortunately, this piece may be on the chopping block soon, as I may have found another watch that fits the bill."
    },
    {
        "id": 5,
        "title": "Omega x Swatch x Peanuts MoonSwatch",
        "description": "When the MoonSwatch first came out, I found the concept extremely cool but I didn't live near a Swatch store to get one. However, when the Snoopy editions came out, I was living within 10 minutes of a Swatch store. I'd call the store every day for about a month asking if they received one in stock, and one day I was lucky enough to get one. This watch is one of the most comfortable watches I own, as the plastic case is light and the silicone strap is extremely soft and water resistant. This is a great fun piece and has an iconic presence on the wrist."
    },
    {
        "id": 6,
        "title": "Skagen Dual-Time",
        "description": "A surprisingly nice $5 thrift store find. I found this in a Goodwill in La Jolla, and brought it home to clean up. Thankfully, all it needed was some deep cleaning and a new set of batteries (it needs two for both movements) to make it factory fresh. I'm glad to have found a watch that has this dual time design and a bauhaus-esque design for such a low price."
    },
    {
        "id": 7,
        "title": "Camy Montego Superautomatic",
        "description": "While visiting my sister in New York in 2024, I remembered seeing videos of Chen’s watch, a vintage watch shop in Chinatown, and decided to check out their selection. My original goal was to find an Omega Geneve Dynamic, but it was out of my price range and had some quirks that would make it difficult to keep long-term. That's when I stumbled upon this Camy, which has a generic ETA movement inside (allowing it to be serviced by almost anyone) and a similar cushion case for under $300, which seemed like a much better value proposition. I later found this tapered ladder-link bracelet that suits the watch extremely well, and can’t imagine the watch paired with anything else."
    },
    {
        "id": 8,
        "title": "Tissot PRX 35mm",
        "description": "Quite a common watch these days, but I chose the 35mm because I believe it is more faithful to the original integrated bracelet watches of the 1970s. My main goal was to modify the PRX, and found that the 27.5mm dial is extremely common in Swiss watches. I have tried many dials (most notably a Tiffany and Co. dial), but recently swapped it out with this gorgeous red lacquer dial and paired it with thinner gold hands to match. The watch reminds me of a Cartier box, and the dial color is truly one of a kind."
    }
]